{
  "listings": [
    {
      "title": "Principal Energy Markets Manager",
      "location": "Multiple Locations, United States",
      "datePosted": "Aug 21, 2024",
      "jobId": "1752527",
      "workSite": "Up to 100% work from home",
      "travel": "0-25 %",
      "roleType": "People Manager",
      "profession": "Hardware Engineering",
      "discipline": "Sourcing Engineering",
      "employmentType": "Full-Time",
      "applyURL": "No apply URL found",
      "description": " As part of the Cloud Operations + Innovations (CO+I) organization, the Energy Markets team supports datacenter interconnection and energy supply contracts with utilities and third-party suppliers. Additionally, the team leads regulatory and policy strategy development with utilities, regulators, and stakeholders important to datacenter and clean energy infrastructure delivery. All of this is done in support of Microsoft’s long-term 100/100/0 vision – that on all the world’s grids, 100 percent of electrons, 100 percent of the time are generated from zero carbon sources.  As a Principal Energy Markets Manager, you will oversee a portfolio of activities in our US and Canada regions to optimize and execute opportunities in datacenter energy supply and technology, including:  A successful candidate will thrive working cross functionally with other business stakeholders that are essential to successful project execution. This necessitates that the candidate brings an innovative, collaborative presence to the role towards driving commercial & technology execution to realize business goals, lower costs, and meet sustainability targets. Responsibilities",
      "responsibilities": "Manage regional project managers Support site selection efforts, datacenter interconnection strategy, and execution in partnership with utilities Develop an energy lease colocation provider program Negotiate energy rate tariffs/special contracts Identify regulatory and policy opportunities for Microsoft Identify market conditions material to our business Lead and assist regional PMs on regulatory engagements with utilities, regulators, and related stakeholders important to datacenter infrastructure deliver, cost/range management and sustainability goals. Oversee Regional PMs on datacenter interconnection and energy supply contract development with utilities and third-party energy suppliers in support of Microsoft’s datacenter businesses in the Americas. Lead or assist Regional PMs in the analysis of energy industry trends, market policy and regulations to proactively identify opportunities to reduce cost, minimize risk, and advance sustainability goals. Partner with globally distributed internal stakeholders on site selection and energy project development, e.g. distributed energy, renewables. Work collaboratively with external vendors and consultants on regional market research. Develop a program to manage capacity provided by colocation providers focusing on energy procurement, utility application process, and energy lease standardization. Build relationships with external suppliers and partners, particularly electric utilities, local and regional regulatory agencies, customers, and energy technology providers. Business travel required (10%-25%, subject to fluctuation with business tempo). Embody our Culture and Values Embody our Culture and Values",
      "Qualifications": "No qualifications found",
      "benefits": [
        "Industry leading healthcare",
        "Educational resources",
        "Discounts on products and services",
        "Savings and investments",
        "Maternity and paternity leave",
        "Generous time away",
        "Giving programs",
        "Opportunities to network and connect"
      ],
      "company": "Microsoft"
    }
  ]
}