{
  "listings": [
    {
      "title": "Inventory and Asset Technician - Onsite - Rio de Janeiro",
      "location": "Rio de Janeiro, Brazil",
      "datePosted": "Aug 23, 2024",
      "jobId": "1755701",
      "workSite": "Microsoft on-site only",
      "travel": "0-25 %",
      "roleType": "Individual Contributor",
      "profession": "Supply Chain",
      "discipline": "Materials Handling",
      "employmentType": "Full-Time",
      "url": "https://jobs.careers.microsoft.com/global/en/job/1755701/Inventory%20and%20Asset%20Technician%20-%20Onsite%20-%20Rio%20de%20Janeiro",
      "description": "As a Microsoft Data Center Inventory & Asset Technician (DIAT), you will perform cycle audits, execute incoming/outgoing deliveries, coordinate security escorts for third-party vendors, and document inbound and outbound deliveries as instructed by management.  You will initiate warranty claims and process returns on failed equipment. This opportunity will allow you to build working knowledge of inventory management principles, warranty process management, data bearing device destruction, and advance your career in the process.  Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.",
      "responsibilities": "Perform assigned tasks and escalate issues during high-volume work activity or escalation-based situations under the guidance of more experienced Data Center colleagues.    Coordinate with suppliers to initiate warranty claim and process failed vendor hardware devices. This includes information processing, packaging, shipment, and receipt of return for Return Merchandise Authorization (RMA) devices following all Service Level Agreements (SLAs) related to RMA warranty process. Develop working knowledge of stock control and inventory management practices and procedures. Ensure accurate documentation of incoming and outgoing deliveries as well as records. Become familiar with guidelines set by Microsoft contractual agreements with suppliers and maintain a strong customer focus. Perform cycle audits and data corrections to ensure all inventory controls are met. Help to reconcile and report inventory discrepancies. Ensure detailed physical inventory tracking and staging. Under the supervision of more experienced Data Center colleagues, destruction of data bearing devices (DBD) following all Service Level Agreements (SLAs) and Microsoft policies. Comply with all security and data management policies. Embody our culture and values.",
      "minimumQualifications": "Upload your resume in English High School Diploma 6 months experience or an internship in inventory management, retail, warehouse management, material hanlder experience or a related field. Able to communicate in English in both written and spoken form Able to communicate in Portuguese Able to work on-site 100% of the time in Rio de Janeiro, Brazil.",
      "otherRequirements": "",
      "preferredQualifications": "",
      "salary": "",
      "benefits": [
        "Industry leading healthcare",
        "Educational resources",
        "Discounts on products and services",
        "Savings and investments",
        "Maternity and paternity leave",
        "Generous time away",
        "Giving programs",
        "Opportunities to network and connect"
      ],
      "company": "Microsoft"
    }
  ]
}