{
  "listings": [
    {
      "title": "Microsoft Technical Training",
      "location": "Dubai, United Arab Emirates",
      "datePosted": "Aug 22, 2024",
      "jobId": "1754756",
      "workSite": "Up to 100% work from home",
      "travel": "0-25 %",
      "roleType": "Individual Contributor",
      "profession": "Learning",
      "discipline": "Technical Training",
      "employmentType": "Full-Time",
      "applyURL": "No apply URL found",
      "description": "Do you want to join an exciting, fast paced and innovative team? If you’re excited about technology and helping Microsoft’s Enterprise Customers, Partners and external communities learn, if you like to see that ‘lightbulb’ moment in others, come join us and put your skills to great use!  Skilling has never been more important than it is right now – technology is changing every second of the day and the industry needs a skilled workforce to enable businesses to innovate and succeed.  Come join Worldwide Learning’s Enterprise Skills Initiative program as we help our customers realize their potential through their employees. Help guide our approach and be ready to join a group where all ideas are heard and providing technology education is job one.  In this role, you will spend your time educating employees from companies all over the world on our Azure cloud. We'll help you become a best-in-class technical trainer to deliver digitally enhanced instructor-led training, you'll help us drive the right Azure skills that enable our customers to succeed. If you're already passionate about technology and motivating others, if you relish the opportunity to help revolutionize what it means to skill and be skilled, then all that's left is for you to apply and help us empower every organization and individual to achieve more.  Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centred on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. Growth mindset encourages each of us to lean in and learn what matters most to our customers, to create the foundational knowledge that enables us to make customer-first decisions in everything we do. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us achieve our mission.",
      "responsibilities": "No responsibilities found",
      "minimumQualifications": "No qualifications found",
      "otherRequirements": "",
      "preferredRequirements": "",
      "benefits": [
        "Industry leading healthcare",
        "Educational resources",
        "Discounts on products and services",
        "Savings and investments",
        "Maternity and paternity leave",
        "Generous time away",
        "Giving programs",
        "Opportunities to network and connect"
      ],
      "company": "Microsoft"
    }
  ]
}