{
  "listings": [
    {
      "title": "Software Engineer II - Linux Kernel",
      "location": "Redmond, Washington, United States",
      "datePosted": "Aug 22, 2024",
      "jobId": "1754743",
      "workSite": "Up to 100% work from home",
      "travel": "0-25 %",
      "roleType": "Individual Contributor",
      "profession": "Software Engineering",
      "discipline": "Software Engineering",
      "employmentType": "Full-Time",
      "applyURL": "No apply URL found",
      "description": "Do you want to participate in creating and delivering the next generation of technologies to power private and public cloud infrastructures? Do you love to contribute to open-source technologies and communities across the globe? Do you want to be part of a high-energy and creative team that is currently impacting millions of customers across the planet? The Linux Systems Group is building the Linux based technologies at Microsoft, and we are looking for a talented Software Engineer II - Linux Kernel to join our team. If you are interested in working on Linux at Microsoft, this is the job for you!  Our team plays a key leadership role in Azure by driving Linux and open-source technologies, solutions, and strategy. In this role, you will work closely with internal and external partners, coordinate design and coding across multiple projects, and interact with teams in disparate geographic locations. You will work closely with upstream open-source projects, representing Microsoft as a community partner and contributor. You will be developing cutting edge accelerations and optimizations to power future public and private clouds. You will define and push the limits of innovative technologies -- working with the latest hardware, the largest servers, and even larger data centers.   If you love to solve the large-scale enterprise issues and enjoy working on system-level design and implementations, this is the right place for you! Come and join us to build our next generation cloud and services, which will have significant impact on millions of customers across the planet!  In Core OS, we are responsible for the Operating Systems that power Azure, Microsoft's Linux OS, the platforms for Windows Client and Xbox, and our Windows Server ecosystem – through all of these, we support every one of our cloud businesses and billions of customers around the world. In this era of ubiquitous computing, systems software excellence has never been more important for Microsoft. High quality, high-efficiency operating systems and platform components underpin everything we do as a company, from making our systems more reliable for our customers, to increasing our competitiveness by reducing COGS, to delivering new features and capabilities to delight customers – that’s all us!  Additional Requirements Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.",
      "responsibilities": "Rotation in a live site operations virtual team with on-call duties (split between a primary and backup role) from 8:00 AM - 8:00 PM PST On-call requirements that impact off-hours (nights/weekends) will be offset with weekday time off Triaging, debugging, and fixing Linux kernel bugs seen in production. Linux kernel development, including aspects of feature validation. Working within the upstream Linux kernel community to contribute and review patches. Embody our culture and values",
      "minimumQualifications": "No qualifications found",
      "otherRequirements": "",
      "preferredRequirements": "",
      "benefits": [
        "Industry leading healthcare",
        "Educational resources",
        "Discounts on products and services",
        "Savings and investments",
        "Maternity and paternity leave",
        "Generous time away",
        "Giving programs",
        "Opportunities to network and connect"
      ],
      "company": "Microsoft"
    }
  ]
}